import streamlit as st

# Page title
st.title("!...לגבינו")
st.write(
    """
        מלחמת "חרבות ברזל" כביכול נגמרה אך השפעותיה עדיין גורמות לדימום שוק התיירות בצפון 
הרחוק. על פי נתוני הלשכה המרכזית לסטטיסטיקה, ההכנסות מתיירות באזור הצפון ירדו בכ-30%        
בתקופת הלחימה, ולמרות שעבר זמן מסוף המלחמה, העסקים בצפון עדיין מרגישים את החוסר         
        בתיירות. בעקבות זאת החלטנו לייסד אתר שנועד לעודד תיירות בצפון הארץ. באתר תמצאו הכל 
מבתי קפה וצימרים ועד מקומות התנדבות וזאת בכדי שכל משתמש יוכל למצוא את החוויה        
        האידיאלית עבורו.
        מכירים עסק שעדיין לא קיים באפליקציה? צרו איתנו קשר!
        מס' טלפון – 0525381648
    """)
