import streamlit as st
st.markdown(
    """
    <style>
    .stApp {
        background-color: #e6f7ff;  /* Light blue background */
    }
    </style>
    """,
    unsafe_allow_html=True
)
# Page title
st.title("אטרקציות")

the_acts = {
    "להקת 'גברים בשחור'": [
      "https://www.bgalil.co.il/files/tinymceuploads/moshe_1.jpg",
      'להקת "גברים בשחור" הינה להקה שחבריה תושבי נהריה המופיעים באופן מקצועי מספר רב של שנים, על בימות גדולות כקטנות, באירועים ממלכתיים וציבוריים לצד אירועים פרטיים. \n בין לקוחותינו, רשויות מקומיות רשת המתנס"ם, אוניברסיטאות, בתי חולים, מושבים וקיבוצים, מועדונים פרטיים, חברות הייטק ומפעלי תעשייה וכן ארגונים ואנשים פרטיים. \n הלהקה שרה רפרטואר עשיר מאוד בעברית ובשלל שפות ומעלה לעיתים מופעים בנושאים שונים.'
    ],
    "אוכל דרוזי אירוח וסדנאות במטבח הביתי של סוהא": [
      "https://www.bgalil.co.il/files/tinymceuploads/Soha_Gadaban1.jpg",
      "סוהא גדבאן מבשלת מתכונים שיש בהם נשמה ואהבה כנה , אהבה לאנשים, לשמן הזיית, עלי הגפן והתבלינים של אימא וחולמת לפתוח את הטעמים הדרוזים לכל עם ישראל, להכניס לזיכרון טעם של פעם טעם של עוד ועוד."
    ],
    "מוזיאון חומה ומגדל חניתה": [
      "https://www.bgalil.co.il/files/tinymceuploads/%D7%9E%D7%95%D7%96%D7%99%D7%90%D7%95%D7%9F_%D7%97%D7%A0%D7%99%D7%AA%D7%94_4_1300.jpg",
      "מוזיאון חומה ומגדל חניתה נמצא בלב הקבוץ, בבית אבן בראש ההר המשקיף אל נופו המרהיב של הגליל המערבי. \n חניתה מסמלת את שיאו של מבצע 'חומה ומגדל'. \n העלייה לקרקע במקום מרוחק ומבודד בלב אזור עוין ובעיצומם של 'המאורעות' עוררה רושם עז ביישוב היהודי, והפכה את חניתה לסמל לאומי של ההתיישבות החדשה בארץ ישראל. \n במוזיאון מוצגים אירועי התקופה, סיפור העלייה לקרקע ושנותיו הראשונות של הקיבוץ."
    ],
    "סדנת קרמיקה פרטית בסטודיו קסום על הר כמון": [
      "https://basalon.co.il/wp-content/uploads/2019/06/IMG_9403-scaled.jpg",
      "רק 10 דקות מכרמיאל על פסגת הר כמון הקסום מסתתר לו הסטודיו שלי ביחידה אינטימית מול נוף משגע. בסטודיו נקיים מפגש ראשוני עם העולם הקרמי וטעימה מטכניקות שונות לעבודה עם החומר. זו עשיה מאתגרת וממכרת המשלבת את הפיזי והרוחני, ומאפשרת לכל החושים לשתף פעולה יחד. במהלך הסדנא תיערך הדגמה ואחריה כל המשתתפים יתנסו באופן מונחה בעבודה בחומר. עד 4 משתתפים נוכל לקיים את הסדנא על גלגל האבניים או בטכניקות שונות בעבודת יד סביב שולחן העבודה . לאחר כשלושה שבועות הכלים יהיו צבועים ומוכנים לאיסוף."
    ]
}

for activity in the_acts.keys():
    st.write(f"# {activity}")
    image = the_acts[activity][0]
    st.image(image, width=200)
    st.write(the_acts[activity][1])
