import streamlit as st

# Page title
st.title("מסעדות ועגלות קפה")

places = {
    "דג על הדן": [
      "https://images.unsplash.com/photo-1544025162-d76694265947",
      "מסעדת דגים ותיקה ואייקונית השוכנת על גדות נחל הדן בגליל העליון (סמוך לחורשת טל). המסעדה התמודדה עם סגירה ממושכת עקב הלחימה בגבול הצפון והיעדר תיירות, וזקוקה למבקרים שיחזרו להחיות את המקום."
    ],
    "עגלת קפה 'פתפותים' (קיבוץ עמיעד)": [
      "https://images.unsplash.com/photo-1501339847302-ac426a4a7cbb",
      "עגלת קפה קסומה בכניסה לקיבוץ עמיעד שבגליל העליון, המציעה מאפים ולחמים מ-100% קמח כוסמין. המקום מהווה נקודת אור מקומית שעובדת קשה כדי לשמור על שגרה ולמשוך בחזרה מטיילים לאזור."
    ],
    "קפה מוייז (מושב רמות)": [
      "https://images.unsplash.com/photo-1495474472287-4d71bcdd2085",
      "עגלת קפה ומאפייה הממוקמת במושב רמות שברמת הגולן, עם תצפית מרהיבה לכינרת. העסק נסמך רבות על תיירות פנים ברמת הגולן שספגה ירידה דרסטית עקב המצב הביטחוני בצפון."
    ],
    "קפה BARAKA (קיבוץ מעיין ברוך)": [
      "https://images.unsplash.com/photo-1554118811-1e0d58224f24",
      "עגלת קפה מקומית הממוקמת בקיבוץ מעיין ברוך שבאצבע הגליל. העסק שוכן בלב אזור שפונה מתושביו סבל מהיעדר מבקרים במשך תקופה ארוכה, וכעת מחכה לתמיכת המטיילים."
    ]
  }

for place in places.keys():
    st.write(f"# {place}", font=("Ariel", 5))
    image = places[place][0]
    st.image(image, width=200)
    st.write(places[place][1])
