import streamlit as st

# Page title
st.title("טיולים ומצפים")

places = {
    "מצפה בניה (משגב עם)": [
      "https://images.unsplash.com/photo-1506744038136-46273834b3fb",
      "נקודת תצפית מרהיבה באצבע הגליל הצופה לעמק החולה ולרמת הגולן. המצפה לזכרו של רס\"ן בניה ריין ז\"ל חווה היעדר מבקרים ממושך בשל המצב הביטחוני ומחכה לשובם של המטיילים."
    ],
    "נחל שניר (חצבאני)": [
      "https://images.unsplash.com/photo-1448375240586-882707db888b",
      "מסלול מים מרהיב ומוצל בלב הגליל העליון, העובר לצד זרימה איתנה וצמחייה ענפה. השמורה שסבלה ממיעוט המטיילים באזור הגבול מזמינה את הציבור לחזור ולטייל בשביליה."
    ],
    "מצפה דדו (מטולה)": [
      "https://images.unsplash.com/photo-1464822759023-fed622ff2c3b",
      "נקודת התצפית הצפונית ביותר ברכס רמים, המציעה פנורמה יוצאת דופן על הרי הלבנון, עמק החולה והחרמון. המקום סבל משממה תיירותית ומייחל לחזרת המטיילים והחיים ליישוב."
    ],
    "פארק הירדן ובריכת המשושים": [
      "https://images.unsplash.com/photo-1501785888041-af3ef285b470",
      "מסלולי טיול ונקודות חמד לאורך נהר הירדן ודרום רמת הגולן. האזור חווה ירידה דרסטית במספר המבקרים וזקוק לתמיכת המטיילים כדי להחזיר את הפעילות והתיירות לסדרה."
    ]
}

for place in places.keys():
    st.write(f"# {place}")
    image = places[place][0]
    st.image(image, width=200)
    st.write(places[place][1])
