import streamlit as st
st.markdown(
    """
    <style>
    .stApp {
        background-color: #e6f7ff;  /* Light blue background */
    }
    </style>
    """,
    unsafe_allow_html=True
)
# Page title
st.title("התנדבויות")

places = {
    "בישול ארוחה חמה במועדון למען נכי צה''ל": [
      "https://pic1.calcalist.co.il/picserver3/crop_images/2024/06/15/HyY11aXorR/HyY11aXorR_0_0_2000_1125_0_xx-large.jpg",
      "מועדון נכי צה''ל מהווה מסגרת חברתית ותעסוקתית עבור פצועי צה''ל בטבריה. למועדון דרושים מתנדבים לבישול ארוחה חמה לבאי המועדון. ההתנדבות כוללת הגעה למועדון ובישול ארוחה חמה ממצרכים שהמועדון מספק למתנדב. ההתנדבות מתקיימת בימי א'-ה', בין השעות 09:00-13:00, למשך כארבע שעות או עד שהמתנדב מסיים לבשל. נדרשת התחייבות לפרויקט לשלושה חודשים לפחות.\n"
      "טבריה - לא מתאים לקבוצות - גיל 22 ומעלה - התנדבות לטווח ארוך"
    ],
    "חונכות אישית לניצולי שואה": [
      "https://res.cloudinary.com/globes/image/upload/t_desktop_article_content_header_800%2A392/v1643181074/direct/shutterstock_1012492390_rz06kq.jpg",
      "''עמך'' היא עמותה ללא מטרות רווח המתמודדת באופן ייחודי עם צרכים נפשיים וחברתיים של ניצולי השואה ובני משפחותיהם. לעמותה דרושים מתנדבים לחונכות אישית וליווי ניצולי שואה. ההתנדבות כוללת הגעה לבית הניצול/לבית האבות בו מתגורר, בילוי משותף והפגת הבדידות באמצעות שיחה משותפת, משחק, יציאה לטיול וכו'. ההתנדבות מתקיימת בימים ושעות גמישים בתיאום מול הקשיש, למשך שעה לפחות בשבוע. ההתחייבות לפרויקט הינה לשנה לפחות.\n"
      "נהריה - לא מתאים לקבוצות - גיל 18 ומעלה - התנדבות לטווח ארוך"
    ],
    "חלוקת סלי מזון למשפחות נזקקות": [
      "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRqcdRLxobnET7PF9bGRcJBnb3XqdNnLZf3mqG2JCVLRQ&s=10",
      "עמותת שכן טוב החלה כיוזמה מקומית של קבוצת צעירים ירושלמית שהחליטה לסייע למשפחה קשת יום בקניית מצרכי מזון לקראת שבת. מאז, כבר למעלה מ-20 שנה, התרחבה פעילות העמותה למגוון רחב של עשיה אליה נרתמים אלפי מתנדבים שתורמים מזמנם, מרצם וכספם. סניף ''שכן טוב'' בצפת הוקם על-מנת לסייע למשפחות נזקקות במתן מזון, למען הקהילה בעיר. לעמותת ''שכן טוב'' בצפת דרושים מתנדבים עם רשיון נהיגה ורכב, לחלוקת מזון למען נזקקים. ההתנדבות כוללת הגעה למרכז החלוקה, איסוף החבילות ונסיעה לחלוקתן ברחבי העיר. ההתנדבות מתקיימת בימי רביעי וחמישי, בין השעות 17:00-20:00. ההתנדבות רלוונטית לקבוצות של עד 5 וכן להתנדבות של הורים עם ילדיהם. ניתן להגיע באופן חד פעמי.\n"
      "צפת - מתאים גם לקבוצות - גיל 12 ומעלה - התנדבות חד פעמית"
    ],
    "סיוע בעבודה חקלאית בבוסתן": [
      "https://www.hashomer.org.il/wp-content/uploads/2024/03/20210624_182210_optimized-scaled.jpg",
      "בוסתן תם הינו מרכז לימודי חוויתי להקניית ידע וערכים לשימור הסביבה ולדו-קיום בין אדם לטבע. דרושים מתנדבים עבור סיוע חקלאי ותחזוקת הבוסתן. ההתנדבות כוללת הגעה בוסתן הנמצא בחווה מקורה הצמודה לכרם מה''ל, וסיוע במשימות חקלאיות מגוונות כגון שתילה, גיזום ותחזוק סביבתי שוטף. התנדבות בחקלאות מתקיימת בימי שלישי בין 8:00-12:00, בתיאום עם רכז החקלאות והשטח. ההתנדבות מתאימה לכל עונות השנה ואין צורך בהתחייבות קבועה לפרויקט. המרחב המוגן נמצא במרחק של כ־200 מטר מהחווה, ולכן המקום פחות מתאים למי שעלול להתקשות להגיע אליו בזמן.\n"
      "ב-5 יישובים שונים - מתאים גם לקבוצות - גיל 12 ומעלה - התנדבות חד פעמית או לטווח ארוך"
    ]
}

for place in places.keys():
    st.write(f"# {place}")
    image = places[place][0]
    st.image(image, width=200)
    st.write(places[place][1])
